//++++++++++++++++++++++++++++++++++++++++++++++++++
//  Author: 云天河Blog       http://www.hlzblog.top/
//++++++++++++++++++++++++++++++++++++++++++++++++++

/**
* 逻辑类 --- 基类
*/
export default class Base {
  constructor(pointer){
    this.p = pointer ; // 存储对应视图组件的 this指针
  }
  //++++++++++++++++++++++++++++++++++++++++++++++++++
  //                     本地逻辑
  //++++++++++++++++++++++++++++++++++++++++++++++++++

  /**
  * 弹出消息
  * @param string msg  消息内容
  */
  __toast( msg ){
    // 假设人的正常阅读速度为 3个字每秒 计算时间
    let time = Math.ceil(msg.length / 3);
    this.p.refs.toast.show(msg, time * 1000);
  }

  //++++++++++++++++++++++++++++++++++++++++++++++++++
  //                    涉及网络
  //++++++++++++++++++++++++++++++++++++++++++++++++++

}