//++++++++++++++++++++++++++++++++++++++++++++++++++
//  Author: 云天河Blog       http://www.hlzblog.top/
//++++++++++++++++++++++++++++++++++++++++++++++++++

/**
* 逻辑类 --- 基类    通过 this.__logic调用
*/
export default class Base {
  constructor(pointer){
    this.p = pointer ; // 存储对应视图组件的 this指针
  }
  //++++++++++++++++++++++++++++++++++++++++++++++++++
  //                     本地逻辑
  //++++++++++++++++++++++++++++++++++++++++++++++++++
  
  /**
  * 弹出消息
  * @param string msg  消息内容
  * @param int    time 显示时间，单位秒
  */
  toast(msg, time=1){
    this.p.refs.toast.show(msg, time * 1000);
  }

  //++++++++++++++++++++++++++++++++++++++++++++++++++
  //                    涉及网络
  //++++++++++++++++++++++++++++++++++++++++++++++++++

}