//++++++++++++++++++++++++++++++++++++++++++++++++++
//  Author: 云天河Blog       http://www.hlzblog.top/
//++++++++++++++++++++++++++++++++++++++++++++++++++

import {
  Dimensions,
  PixelRatio,
}
from 'react-native';

// 配置全局环境变量

global.env = {
  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  //                  网络请求 - HTTP
  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  // 路由域名配置
  router_host: 'http://169.254.243.75/', // 域名 - 本地以太网
  // router_host: 'http://iotapp.hlzblog.top/', // 域名 - 生产环境


  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  //                  屏幕设置
  //++++++++++++++++++++++++++++++++++++++++++++++++++++++

  // 百分比布局
  width : Dimensions.get('window').width ,  // 获取屏幕 宽  
  height: Dimensions.get('window').height,  // 获取屏幕 高  
  // 图片适应屏幕分辨率
  pic_pix: 1 / PixelRatio.get(), // 像素 * 密度比，图片用


  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  //                  微信、QQ、支付宝
  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  wechat_appid: '', // 微信登录、分享、支付，需要使用


  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  //                 工具类
  //++++++++++++++++++++++++++++++++++++++++++++++++++++++

  log_switch : 1,     // 关 -> 0 , 开 -> 1
  log_least_level: 1, // 输出日志，要求的 最低日志等级   等级限制  1 到 4


};
