//++++++++++++++++++++++++++++++++++++++++++++++++++
//  Author: 云天河Blog       http://www.hlzblog.top/
//++++++++++++++++++++++++++++++++++++++++++++++++++

import {
  Dimensions,
  PixelRatio,
  Platform,
}
from 'react-native';

/**
* 注意：生成release时,
* 请设置 app_debug 为 false
* 请设置 router_host 为生成环境地址
* 请设置 版本号
*/

// 配置全局环境变量

global.env = {


  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  //                  APP基础配置
  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  app_debug: true, // 如果生成release版，请设置为 false
  app_version: "0.0.2", //　当前版本号
  app_download_prefix: "",　//　CDN下载前缀，安卓端直接下载
  // 平台判断
  is_ios: Platform.OS === 'ios' ? true : false,

  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  //                  网络请求 - HTTP
  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  // 路由域名配置
  router_host: 'http://192.168.56.1/', // 域名 - 本地以太网 虚拟网卡
  // router_host: 'http://iotapp.hlzblog.top/', // 域名 - 生产环境


  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  //                  屏幕设置
  //++++++++++++++++++++++++++++++++++++++++++++++++++++++

  // 百分比布局
  width : Dimensions.get('window').width ,  // 获取屏幕 宽
  height: Dimensions.get('window').height,  // 获取屏幕 高
  // 图片适应屏幕分辨率
  pix: 1 / PixelRatio.get(), // 像素 * 密度比，图片用


  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  //                  微信、QQ、支付宝
  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  wechat_appid: '', // 微信登录、分享、支付，需要使用


  //++++++++++++++++++++++++++++++++++++++++++++++++++++++
  //                  工具类
  //++++++++++++++++++++++++++++++++++++++++++++++++++++++

  log_switch : 1,     // 关 -> 0 , 开 -> 1
  log_least_level: 1, // 输出日志，要求的 最低日志等级   等级限制  1 到 4


};
